app/controllers/books_controller.rb

    def show
        @book = BookInventory.find(params[:id ])
---
SELECT "book_inventories".* FROM "book_inventories" WHERE "book_inventories"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]