app/controllers/books_controller.rb

SELECT "book_inventories".* FROM "book_inventories"
---
    def index
        @books = BookInventory.all

INSERT INTO "book_inventories" ("title", "author", "year", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", nil], ["author", nil], ["year", nil], ["description", nil], ["created_at", "2023-06-27 21:20:53.270035"], ["updated_at", "2023-06-27 21:20:53.270035"]]
---
    def create
        @book = BookInventory.new(book_params)
        if @book.save

SELECT "book_inventories".* FROM "book_inventories" WHERE "book_inventories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_book
        @book = BookInventory.find(params[:id ])